app/controllers/articles_controller.rb

  def index
    if params[:category]
      @articles = Article.send(params[:category])
    else
      @articles = Article.all
---
SELECT * FROM `articles`
SELECT * FROM `categories`