app/controllers/covecaysales_controller.rb

  def show
    @covecaysale = Covecaysale.find(params[:id])
---
SELECT * FROM `covecaysales` WHERE (`covecaysales`.`id` = 953125641)

  def edit
    @covecaysale = Covecaysale.find(params[:id])
---
SELECT * FROM `covecaysales` WHERE (`covecaysales`.`id` = 953125641)

  def update
    @covecaysale = Covecaysale.find(params[:id])
---
SELECT * FROM `covecaysales` WHERE (`covecaysales`.`id` = 953125641)